{
  "titles": [
    {
      "name": "Home"
    },
    {
      "name": "Experience"
    },
    {
      "name": "Work"
    }
  ],
  "experience": {
    "work": [
      {
        "title": "Fullstack Developer",
        "company_name": "Apliman",
        "description": "As a Flutter web developer, I created and maintained high-quality web applications using Flutter. I use Git, GitLab, and Bitbucket for project collaboration. I also developed APIs and managed databases using Spring Boot and SQL.My responsibilities included web application development, open-source library maintenance, cross-functional team collaboration, Git and GitLab version control, and API development and database management using Spring Boot and SQL. Overall, my experience as a Flutter web developer has given me a strong foundation in web application development and open-source contribution.",
        "date": "September 2022 - Present",
        "company_location": "Beirut, Lebanon",
        "company_website": "https://www.apliman.com",
        "company_phone": "+971 504882137",
        "responsibilities": [
          "Design and develop web applications using Flutter framework.",
          "Maintain and contribute to open-source libraries in Flutter for web development.",
          "Collaborate with cross-functional teams to ensure application meets user needs and requirements.",
          "Use Git, GitLab, and Bitbucket for version control and collaboration with other developers.",
          "Develop APIs and manage databases using Spring Boot and SQL."
        ]
      },
      {
        "title": "Flutter Developer",
        "company_name": "Easysoft LB",
        "description": "As a Flutter mobile developer, I was responsible for developing high-quality mobile applications for both iOS and Android platforms using the Flutter framework. I worked collaboratively with cross-functional teams, including designers and product managers, to ensure that the applications met user needs and requirements.In addition to mobile application development, I also created and maintained libraries in Flutter that can be used by other developers to contribute to the open-source community.",
        "date": "September 2021 - September 2022",
        "company_location": "Beirut, Lebanon",
        "company_website": "https://www.easysoft.com.lb",
        "company_phone": "+961 1335515",
        "responsibilities": [
          "Develop and maintain high-quality mobile applications using Flutter framework for both iOS and Android platforms.",
          "Write efficient, clean, and maintainable code that adheres to coding standards and best practices.",
          "Create and maintain libraries in Flutter that can be used by other developers to contribute to the open-source community.",
          "Debug and troubleshoot issues reported by users or the QA team, and propose and implement effective solutions.",
          "Publish developed applications to both iOS and Android app stores and ensure compliance with app store guidelines and regulations."
        ]
      }
    ]
  }
}